; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph3 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	spectrograph4 - mode
	infrared6 - mode
	spectrograph1 - mode
	image0 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared6)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Planet6 spectrograph2)
	(have_image Planet7 spectrograph4)
	(have_image Phenomenon8 infrared6)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon10 thermograph3)
	(have_image Star11 spectrograph5)
	(have_image Phenomenon12 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon9 instrument0 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon12 instrument0 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon10 instrument0 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 9
11. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 9
12. (take_image satellite0 phenomenon8 instrument0 infrared6)
   added: (have_image phenomenon8 infrared6)
   goals met: 5 of 9
13. (take_image satellite0 phenomenon8 instrument0 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 6 of 9
14. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 6 of 9
15. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 7 of 9
16. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 7 of 9
17. (take_image satellite0 planet7 instrument0 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 8 of 9
18. (turn_to satellite0 star11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star11)
   goals met: 8 of 9
19. (take_image satellite0 star11 instrument0 spectrograph5)
   added: (have_image star11 spectrograph5)
   goals met: 9 of 9
